zephyrproject-rtos/hal_microchip/include/dt-bindings/pinctrl/pic32cx1025sg41128-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <dt-bindings/pinctrl/microchip_pic32cxsg_pinctrl.h>

/*
 * WARNING: this variant has package exception.
 *
 *   Read datasheet topics related to I/O Multiplexing and Considerations or
 *   Peripheral Signal Multiplexing on I/O Lines for more information.
 */

/* pa0_gpio */
#define PA0_GPIO \
	PIC32CXSG_PINMUX(a, 0, gpio, gpio)

/* pa0a_eic_extint0 */
#define PA0A_EIC_EXTINT0 \
	PIC32CXSG_PINMUX(a, 0, a, periph)

/* pa0d_sercom1_pad0 */
#define PA0D_SERCOM1_PAD0 \
	PIC32CXSG_PINMUX(a, 0, d, periph)

/* pa0e_tc2_wo0 */
#define PA0E_TC2_WO0 \
	PIC32CXSG_PINMUX(a, 0, e, periph)

/* pa1_gpio */
#define PA1_GPIO \
	PIC32CXSG_PINMUX(a, 1, gpio, gpio)

/* pa1a_eic_extint1 */
#define PA1A_EIC_EXTINT1 \
	PIC32CXSG_PINMUX(a, 1, a, periph)

/* pa1d_sercom1_pad1 */
#define PA1D_SERCOM1_PAD1 \
	PIC32CXSG_PINMUX(a, 1, d, periph)

/* pa1e_tc2_wo1 */
#define PA1E_TC2_WO1 \
	PIC32CXSG_PINMUX(a, 1, e, periph)

/* pa2_gpio */
#define PA2_GPIO \
	PIC32CXSG_PINMUX(a, 2, gpio, gpio)

/* pa2a_eic_extint2 */
#define PA2A_EIC_EXTINT2 \
	PIC32CXSG_PINMUX(a, 2, a, periph)

/* pa2b_adc0_ain0 */
#define PA2B_ADC0_AIN0 \
	PIC32CXSG_PINMUX(a, 2, b, periph)

/* pa2b_dac_vout0 */
#define PA2B_DAC_VOUT0 \
	PIC32CXSG_PINMUX(a, 2, b, periph)

/* pa3_gpio */
#define PA3_GPIO \
	PIC32CXSG_PINMUX(a, 3, gpio, gpio)

/* pa3a_eic_extint3 */
#define PA3A_EIC_EXTINT3 \
	PIC32CXSG_PINMUX(a, 3, a, periph)

/* pa3b_anaref_vrefa */
#define PA3B_ANAREF_VREFA \
	PIC32CXSG_PINMUX(a, 3, b, periph)

/* pa3b_adc0_ain1 */
#define PA3B_ADC0_AIN1 \
	PIC32CXSG_PINMUX(a, 3, b, periph)

/* pa3b_ptc_xy0 */
#define PA3B_PTC_XY0 \
	PIC32CXSG_PINMUX(a, 3, b, periph)

/* pa4_gpio */
#define PA4_GPIO \
	PIC32CXSG_PINMUX(a, 4, gpio, gpio)

/* pa4a_eic_extint4 */
#define PA4A_EIC_EXTINT4 \
	PIC32CXSG_PINMUX(a, 4, a, periph)

/* pa4b_anaref_vrefb */
#define PA4B_ANAREF_VREFB \
	PIC32CXSG_PINMUX(a, 4, b, periph)

/* pa4b_adc0_ain4 */
#define PA4B_ADC0_AIN4 \
	PIC32CXSG_PINMUX(a, 4, b, periph)

/* pa4b_ac_ain0 */
#define PA4B_AC_AIN0 \
	PIC32CXSG_PINMUX(a, 4, b, periph)

/* pa4b_ptc_xy3 */
#define PA4B_PTC_XY3 \
	PIC32CXSG_PINMUX(a, 4, b, periph)

/* pa4d_sercom0_pad0 */
#define PA4D_SERCOM0_PAD0 \
	PIC32CXSG_PINMUX(a, 4, d, periph)

/* pa4e_tc0_wo0 */
#define PA4E_TC0_WO0 \
	PIC32CXSG_PINMUX(a, 4, e, periph)

/* pa4n_ccl_in0 */
#define PA4N_CCL_IN0 \
	PIC32CXSG_PINMUX(a, 4, n, periph)

/* pa5_gpio */
#define PA5_GPIO \
	PIC32CXSG_PINMUX(a, 5, gpio, gpio)

/* pa5a_eic_extint5 */
#define PA5A_EIC_EXTINT5 \
	PIC32CXSG_PINMUX(a, 5, a, periph)

/* pa5b_adc0_ain5 */
#define PA5B_ADC0_AIN5 \
	PIC32CXSG_PINMUX(a, 5, b, periph)

/* pa5b_ac_ain1 */
#define PA5B_AC_AIN1 \
	PIC32CXSG_PINMUX(a, 5, b, periph)

/* pa5b_dac_vout1 */
#define PA5B_DAC_VOUT1 \
	PIC32CXSG_PINMUX(a, 5, b, periph)

/* pa5d_sercom0_pad1 */
#define PA5D_SERCOM0_PAD1 \
	PIC32CXSG_PINMUX(a, 5, d, periph)

/* pa5e_tc0_wo1 */
#define PA5E_TC0_WO1 \
	PIC32CXSG_PINMUX(a, 5, e, periph)

/* pa5n_ccl_in1 */
#define PA5N_CCL_IN1 \
	PIC32CXSG_PINMUX(a, 5, n, periph)

/* pa6_gpio */
#define PA6_GPIO \
	PIC32CXSG_PINMUX(a, 6, gpio, gpio)

/* pa6a_eic_extint6 */
#define PA6A_EIC_EXTINT6 \
	PIC32CXSG_PINMUX(a, 6, a, periph)

/* pa6b_anaref_vrefc */
#define PA6B_ANAREF_VREFC \
	PIC32CXSG_PINMUX(a, 6, b, periph)

/* pa6b_adc0_ain6 */
#define PA6B_ADC0_AIN6 \
	PIC32CXSG_PINMUX(a, 6, b, periph)

/* pa6b_ac_ain2 */
#define PA6B_AC_AIN2 \
	PIC32CXSG_PINMUX(a, 6, b, periph)

/* pa6b_ptc_xy4 */
#define PA6B_PTC_XY4 \
	PIC32CXSG_PINMUX(a, 6, b, periph)

/* pa6d_sercom0_pad2 */
#define PA6D_SERCOM0_PAD2 \
	PIC32CXSG_PINMUX(a, 6, d, periph)

/* pa6e_tc1_wo0 */
#define PA6E_TC1_WO0 \
	PIC32CXSG_PINMUX(a, 6, e, periph)

/* pa6i_sdhc0_cd */
#define PA6I_SDHC0_CD \
	PIC32CXSG_PINMUX(a, 6, i, periph)

/* pa6n_ccl_in2 */
#define PA6N_CCL_IN2 \
	PIC32CXSG_PINMUX(a, 6, n, periph)

/* pa7_gpio */
#define PA7_GPIO \
	PIC32CXSG_PINMUX(a, 7, gpio, gpio)

/* pa7a_eic_extint7 */
#define PA7A_EIC_EXTINT7 \
	PIC32CXSG_PINMUX(a, 7, a, periph)

/* pa7b_adc0_ain7 */
#define PA7B_ADC0_AIN7 \
	PIC32CXSG_PINMUX(a, 7, b, periph)

/* pa7b_ac_ain3 */
#define PA7B_AC_AIN3 \
	PIC32CXSG_PINMUX(a, 7, b, periph)

/* pa7b_ptc_xy5 */
#define PA7B_PTC_XY5 \
	PIC32CXSG_PINMUX(a, 7, b, periph)

/* pa7d_sercom0_pad3 */
#define PA7D_SERCOM0_PAD3 \
	PIC32CXSG_PINMUX(a, 7, d, periph)

/* pa7e_tc1_wo1 */
#define PA7E_TC1_WO1 \
	PIC32CXSG_PINMUX(a, 7, e, periph)

/* pa7i_sdhc0_wp */
#define PA7I_SDHC0_WP \
	PIC32CXSG_PINMUX(a, 7, i, periph)

/* pa7n_ccl_out0 */
#define PA7N_CCL_OUT0 \
	PIC32CXSG_PINMUX(a, 7, n, periph)

/* pa8_gpio */
#define PA8_GPIO \
	PIC32CXSG_PINMUX(a, 8, gpio, gpio)

/* pa8a_eic_nmi */
#define PA8A_EIC_NMI \
	PIC32CXSG_PINMUX(a, 8, a, periph)

/* pa8b_adc0_ain8 */
#define PA8B_ADC0_AIN8 \
	PIC32CXSG_PINMUX(a, 8, b, periph)

/* pa8b_adc1_ain2 */
#define PA8B_ADC1_AIN2 \
	PIC32CXSG_PINMUX(a, 8, b, periph)

/* pa8b_ptc_xy6 */
#define PA8B_PTC_XY6 \
	PIC32CXSG_PINMUX(a, 8, b, periph)

/* pa8c_sercom0_pad0 */
#define PA8C_SERCOM0_PAD0 \
	PIC32CXSG_PINMUX(a, 8, c, periph)

/* pa8d_sercom2_pad1 */
#define PA8D_SERCOM2_PAD1 \
	PIC32CXSG_PINMUX(a, 8, d, periph)

/* pa8e_tc0_wo0 */
#define PA8E_TC0_WO0 \
	PIC32CXSG_PINMUX(a, 8, e, periph)

/* pa8f_tcc0_wo0 */
#define PA8F_TCC0_WO0 \
	PIC32CXSG_PINMUX(a, 8, f, periph)

/* pa8g_tcc1_wo4 */
#define PA8G_TCC1_WO4 \
	PIC32CXSG_PINMUX(a, 8, g, periph)

/* pa8h_qspi_data0 */
#define PA8H_QSPI_DATA0 \
	PIC32CXSG_PINMUX(a, 8, h, periph)

/* pa8i_sdhc0_cmd */
#define PA8I_SDHC0_CMD \
	PIC32CXSG_PINMUX(a, 8, i, periph)

/* pa8j_iis_mck0 */
#define PA8J_IIS_MCK0 \
	PIC32CXSG_PINMUX(a, 8, j, periph)

/* pa8n_ccl_in3 */
#define PA8N_CCL_IN3 \
	PIC32CXSG_PINMUX(a, 8, n, periph)

/* pa9_gpio */
#define PA9_GPIO \
	PIC32CXSG_PINMUX(a, 9, gpio, gpio)

/* pa9a_eic_extint9 */
#define PA9A_EIC_EXTINT9 \
	PIC32CXSG_PINMUX(a, 9, a, periph)

/* pa9b_adc0_ain9 */
#define PA9B_ADC0_AIN9 \
	PIC32CXSG_PINMUX(a, 9, b, periph)

/* pa9b_adc1_ain3 */
#define PA9B_ADC1_AIN3 \
	PIC32CXSG_PINMUX(a, 9, b, periph)

/* pa9b_ptc_xy7 */
#define PA9B_PTC_XY7 \
	PIC32CXSG_PINMUX(a, 9, b, periph)

/* pa9c_sercom0_pad1 */
#define PA9C_SERCOM0_PAD1 \
	PIC32CXSG_PINMUX(a, 9, c, periph)

/* pa9d_sercom2_pad0 */
#define PA9D_SERCOM2_PAD0 \
	PIC32CXSG_PINMUX(a, 9, d, periph)

/* pa9e_tc0_wo1 */
#define PA9E_TC0_WO1 \
	PIC32CXSG_PINMUX(a, 9, e, periph)

