zephyrproject-rtos/hal_microchip/include/dt-bindings/pinctrl/pic32cx1025sg41128-pinctrl.h
/* pb18m_gclk_io4 */
#define PB18M_GCLK_IO4 \
	PIC32CXSG_PINMUX(b, 18, m, periph)

/* pb19_gpio */
#define PB19_GPIO \
	PIC32CXSG_PINMUX(b, 19, gpio, gpio)

/* pb19a_eic_extint3 */
#define PB19A_EIC_EXTINT3 \
	PIC32CXSG_PINMUX(b, 19, a, periph)

/* pb19c_sercom5_pad3 */
#define PB19C_SERCOM5_PAD3 \
	PIC32CXSG_PINMUX(b, 19, c, periph)

/* pb19d_sercom7_pad3 */
#define PB19D_SERCOM7_PAD3 \
	PIC32CXSG_PINMUX(b, 19, d, periph)

/* pb19f_tcc1_wo1 */
#define PB19F_TCC1_WO1 \
	PIC32CXSG_PINMUX(b, 19, f, periph)

/* pb19g_pdec_qdi1 */
#define PB19G_PDEC_QDI1 \
	PIC32CXSG_PINMUX(b, 19, g, periph)

/* pb19i_sdhc1_dat1 */
#define PB19I_SDHC1_DAT1 \
	PIC32CXSG_PINMUX(b, 19, i, periph)

/* pb19m_gclk_io5 */
#define PB19M_GCLK_IO5 \
	PIC32CXSG_PINMUX(b, 19, m, periph)

/* pb20_gpio */
#define PB20_GPIO \
	PIC32CXSG_PINMUX(b, 20, gpio, gpio)

/* pb20a_eic_extint4 */
#define PB20A_EIC_EXTINT4 \
	PIC32CXSG_PINMUX(b, 20, a, periph)

/* pb20c_sercom3_pad0 */
#define PB20C_SERCOM3_PAD0 \
	PIC32CXSG_PINMUX(b, 20, c, periph)

/* pb20d_sercom7_pad1 */
#define PB20D_SERCOM7_PAD1 \
	PIC32CXSG_PINMUX(b, 20, d, periph)

/* pb20f_tcc1_wo2 */
#define PB20F_TCC1_WO2 \
	PIC32CXSG_PINMUX(b, 20, f, periph)

/* pb20g_pdec_qdi2 */
#define PB20G_PDEC_QDI2 \
	PIC32CXSG_PINMUX(b, 20, g, periph)

/* pb20i_sdhc1_dat2 */
#define PB20I_SDHC1_DAT2 \
	PIC32CXSG_PINMUX(b, 20, i, periph)

/* pb20m_gclk_io6 */
#define PB20M_GCLK_IO6 \
	PIC32CXSG_PINMUX(b, 20, m, periph)

/* pb21_gpio */
#define PB21_GPIO \
	PIC32CXSG_PINMUX(b, 21, gpio, gpio)

/* pb21a_eic_extint5 */
#define PB21A_EIC_EXTINT5 \
	PIC32CXSG_PINMUX(b, 21, a, periph)

/* pb21c_sercom3_pad1 */
#define PB21C_SERCOM3_PAD1 \
	PIC32CXSG_PINMUX(b, 21, c, periph)

/* pb21d_sercom7_pad0 */
#define PB21D_SERCOM7_PAD0 \
	PIC32CXSG_PINMUX(b, 21, d, periph)

/* pb21f_tcc1_wo3 */
#define PB21F_TCC1_WO3 \
	PIC32CXSG_PINMUX(b, 21, f, periph)

/* pb21i_sdhc1_dat3 */
#define PB21I_SDHC1_DAT3 \
	PIC32CXSG_PINMUX(b, 21, i, periph)

/* pb21m_gclk_io7 */
#define PB21M_GCLK_IO7 \
	PIC32CXSG_PINMUX(b, 21, m, periph)

/* pb22_gpio */
#define PB22_GPIO \
	PIC32CXSG_PINMUX(b, 22, gpio, gpio)

/* pb22a_eic_extint6 */
#define PB22A_EIC_EXTINT6 \
	PIC32CXSG_PINMUX(b, 22, a, periph)

/* pb22c_sercom1_pad2 */
#define PB22C_SERCOM1_PAD2 \
	PIC32CXSG_PINMUX(b, 22, c, periph)

/* pb22d_sercom5_pad2 */
#define PB22D_SERCOM5_PAD2 \
	PIC32CXSG_PINMUX(b, 22, d, periph)

/* pb22e_tc7_wo0 */
#define PB22E_TC7_WO0 \
	PIC32CXSG_PINMUX(b, 22, e, periph)

/* pb22g_pdec_qdi2 */
#define PB22G_PDEC_QDI2 \
	PIC32CXSG_PINMUX(b, 22, g, periph)

/* pb22h_usb_sof */
#define PB22H_USB_SOF \
	PIC32CXSG_PINMUX(b, 22, h, periph)

/* pb22m_gclk_io0 */
#define PB22M_GCLK_IO0 \
	PIC32CXSG_PINMUX(b, 22, m, periph)

/* pb22n_ccl_in0 */
#define PB22N_CCL_IN0 \
	PIC32CXSG_PINMUX(b, 22, n, periph)

/* pb23_gpio */
#define PB23_GPIO \
	PIC32CXSG_PINMUX(b, 23, gpio, gpio)

/* pb23a_eic_extint7 */
#define PB23A_EIC_EXTINT7 \
	PIC32CXSG_PINMUX(b, 23, a, periph)

/* pb23c_sercom1_pad3 */
#define PB23C_SERCOM1_PAD3 \
	PIC32CXSG_PINMUX(b, 23, c, periph)

/* pb23d_sercom5_pad3 */
#define PB23D_SERCOM5_PAD3 \
	PIC32CXSG_PINMUX(b, 23, d, periph)

/* pb23e_tc7_wo1 */
#define PB23E_TC7_WO1 \
	PIC32CXSG_PINMUX(b, 23, e, periph)

/* pb23g_pdec_qdi0 */
#define PB23G_PDEC_QDI0 \
	PIC32CXSG_PINMUX(b, 23, g, periph)

/* pb23m_gclk_io1 */
#define PB23M_GCLK_IO1 \
	PIC32CXSG_PINMUX(b, 23, m, periph)

/* pb23n_ccl_out0 */
#define PB23N_CCL_OUT0 \
	PIC32CXSG_PINMUX(b, 23, n, periph)

/* pb24_gpio */
#define PB24_GPIO \
	PIC32CXSG_PINMUX(b, 24, gpio, gpio)

/* pb24a_eic_extint8 */
#define PB24A_EIC_EXTINT8 \
	PIC32CXSG_PINMUX(b, 24, a, periph)

/* pb24c_sercom0_pad0 */
#define PB24C_SERCOM0_PAD0 \
	PIC32CXSG_PINMUX(b, 24, c, periph)

/* pb24d_sercom2_pad1 */
#define PB24D_SERCOM2_PAD1 \
	PIC32CXSG_PINMUX(b, 24, d, periph)

/* pb24g_pdec_qdi1 */
#define PB24G_PDEC_QDI1 \
	PIC32CXSG_PINMUX(b, 24, g, periph)

/* pb24m_ac_cmp0 */
#define PB24M_AC_CMP0 \
	PIC32CXSG_PINMUX(b, 24, m, periph)

/* pb25_gpio */
#define PB25_GPIO \
	PIC32CXSG_PINMUX(b, 25, gpio, gpio)

/* pb25a_eic_extint9 */
#define PB25A_EIC_EXTINT9 \
	PIC32CXSG_PINMUX(b, 25, a, periph)

/* pb25c_sercom0_pad1 */
#define PB25C_SERCOM0_PAD1 \
	PIC32CXSG_PINMUX(b, 25, c, periph)

/* pb25d_sercom2_pad0 */
#define PB25D_SERCOM2_PAD0 \
	PIC32CXSG_PINMUX(b, 25, d, periph)

/* pb25g_pdec_qdi2 */
#define PB25G_PDEC_QDI2 \
	PIC32CXSG_PINMUX(b, 25, g, periph)

/* pb25m_ac_cmp1 */
#define PB25M_AC_CMP1 \
	PIC32CXSG_PINMUX(b, 25, m, periph)

/* pb26_gpio */
#define PB26_GPIO \
	PIC32CXSG_PINMUX(b, 26, gpio, gpio)

/* pb26a_eic_extint12 */
#define PB26A_EIC_EXTINT12 \
	PIC32CXSG_PINMUX(b, 26, a, periph)

/* pb26c_sercom2_pad0 */
#define PB26C_SERCOM2_PAD0 \
	PIC32CXSG_PINMUX(b, 26, c, periph)

/* pb26d_sercom4_pad1 */
#define PB26D_SERCOM4_PAD1 \
	PIC32CXSG_PINMUX(b, 26, d, periph)

/* pb26f_tcc1_wo2 */
#define PB26F_TCC1_WO2 \
	PIC32CXSG_PINMUX(b, 26, f, periph)

/* pb27_gpio */
#define PB27_GPIO \
	PIC32CXSG_PINMUX(b, 27, gpio, gpio)

/* pb27a_eic_extint13 */
#define PB27A_EIC_EXTINT13 \
	PIC32CXSG_PINMUX(b, 27, a, periph)

/* pb27c_sercom2_pad1 */
#define PB27C_SERCOM2_PAD1 \
	PIC32CXSG_PINMUX(b, 27, c, periph)

/* pb27d_sercom4_pad0 */
#define PB27D_SERCOM4_PAD0 \
	PIC32CXSG_PINMUX(b, 27, d, periph)

/* pb27f_tcc1_wo3 */
#define PB27F_TCC1_WO3 \
	PIC32CXSG_PINMUX(b, 27, f, periph)

/* pb28_gpio */
#define PB28_GPIO \
	PIC32CXSG_PINMUX(b, 28, gpio, gpio)

/* pb28a_eic_extint14 */
#define PB28A_EIC_EXTINT14 \
	PIC32CXSG_PINMUX(b, 28, a, periph)

/* pb28c_sercom2_pad2 */
#define PB28C_SERCOM2_PAD2 \
	PIC32CXSG_PINMUX(b, 28, c, periph)

/* pb28d_sercom4_pad2 */
#define PB28D_SERCOM4_PAD2 \
	PIC32CXSG_PINMUX(b, 28, d, periph)

/* pb28f_tcc1_wo4 */
#define PB28F_TCC1_WO4 \
	PIC32CXSG_PINMUX(b, 28, f, periph)

/* pb28j_iis_sck1 */
#define PB28J_IIS_SCK1 \
	PIC32CXSG_PINMUX(b, 28, j, periph)

/* pb29_gpio */
#define PB29_GPIO \
	PIC32CXSG_PINMUX(b, 29, gpio, gpio)

/* pb29a_eic_extint15 */
#define PB29A_EIC_EXTINT15 \
	PIC32CXSG_PINMUX(b, 29, a, periph)

